Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket.s3-home has changed
~ resource "aws_s3_bucket" "s3-home" {
        id                          = "foodtrucks20220123172537018100000001"
      + tags                        = {}
        # (13 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.public-read has changed
~ resource "aws_s3_bucket_policy" "public-read" {
        id     = "foodtrucks20220123172537018100000001"
      ~ policy = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = [
                            "s3:GetObjectVersion",
                            "s3:GetObject",
                        ]
                        Effect    = "Allow"
                        Principal = "*"
                        Resource  = "arn:aws:s3:::foodtrucks20220123172537018100000001/*"
                        Sid       = ""
                    },
                    {
                        Action    = "s3:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::246850902828:user/github-actions"
                        }
                        Resource  = "arn:aws:s3:::foodtrucks20220123172537018100000001/*"
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_zone.main must be replaced
-/+ resource "aws_route53_zone" "main" {
      ~ arn           = "arn:aws:route53:::hostedzone/Z0975097GI60AUOWBH82" -> (known after apply)
      ~ id            = "Z0975097GI60AUOWBH82" -> (known after apply)
      ~ name          = "findafoodtruck.ga" -> "findafoodtrucknow.ga" # forces replacement
      ~ name_servers  = [
          - "ns-1454.awsdns-53.org",
          - "ns-1679.awsdns-17.co.uk",
          - "ns-437.awsdns-54.com",
          - "ns-851.awsdns-42.net",
        ] -> (known after apply)
      - tags          = {} -> null
      ~ zone_id       = "Z0975097GI60AUOWBH82" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.greenatlantis.ga/lock?id=marknooch%252Ffoodtrucks%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
